#### Terraform Initialization ⚙️``
#### Terraform Plan 📖`success`

Show Plan

```terraform
module.cloudflare_lilja_io_setup.cloudflare_record.cname_dkim1["protonmail3._domainkey"]: Refreshing state... [id=e8665c888f0006a9b36f38ae80b860d1]
module.cloudflare_lilja_io_setup.cloudflare_record.txt_dmarc: Refreshing state... [id=34dcc8e8ec712be680b004d4071f5a89]
module.cloudflare_lilja_io_setup.cloudflare_record.mx_proton_spf1: Refreshing state... [id=27880e7ae87be1c5dcdde52d5763dfb4]
module.cloudflare_lilja_io_setup.cloudflare_record.cname_dkim1["protonmail._domainkey"]: Refreshing state... [id=cd3bbd6e0352097c0c5651ff95a37988]
module.cloudflare_lilja_io_setup.cloudflare_record.mx_proton_mail["mailsec.protonmail.ch"]: Refreshing state... [id=2b9dab6700df6f8a389c327483b1a045]
data.cloudflare_zone.lilja_dot_io: Reading...
module.cloudflare_lilja_io_setup.cloudflare_record.mx_proton_mail["mail.protonmail.ch"]: Refreshing state... [id=17f1e94ab3576c93296900f09c2cad2f]
module.cloudflare_lilja_io_setup.cloudflare_record.mx_proton_protomain_verification: Refreshing state... [id=91f6606f599ea13775f2eab5d362c384]
module.cloudflare_lilja_io_setup.cloudflare_record.cname_dkim1["protonmail2._domainkey"]: Refreshing state... [id=ddb7f0e8bcc1a92e83459eb5643e2827]
data.cloudflare_zone.lilja_dot_io: Read complete after 2s [id=801ec7bc35b2abc9580d847c7b5c6f56]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy

Terraform will perform the following actions:

  # module.cloudflare_lilja_io_setup.cloudflare_record.cname_dkim1["protonmail._domainkey"] will be destroyed
  # (because cloudflare_record.cname_dkim1 is not in configuration)
  - resource "cloudflare_record" "cname_dkim1" {
      - allow_overwrite = false -> null
      - content         = "protonmail.domainkey.dqnuquyqjndrlhl3kd676hycw5l4a2hanxco7ab7n56elpexeanaa.domains.proton.ch" -> null
      - created_on      = "2025-02-01T20:40:57.998167Z" -> null
      - hostname        = "protonmail._domainkey.lilja.io" -> null
      - id              = "cd3bbd6e0352097c0c5651ff95a37988" -> null
      - metadata        = {} -> null
      - modified_on     = "2025-02-01T20:40:57.998167Z" -> null
      - name            = "protonmail._domainkey" -> null
      - proxiable       = true -> null
      - proxied         = false -> null
      - tags            = [] -> null
      - ttl             = 1 -> null
      - type            = "CNAME" -> null
      - zone_id         = "801ec7bc35b2abc9580d847c7b5c6f56" -> null
        # (1 unchanged attribute hidden)
    }

  # module.cloudflare_lilja_io_setup.cloudflare_record.cname_dkim1["protonmail2._domainkey"] will be destroyed
  # (because cloudflare_record.cname_dkim1 is not in configuration)
  - resource "cloudflare_record" "cname_dkim1" {
      - allow_overwrite = false -> null
      - content         = "protonmail2.domainkey.dqnuquyqjndrlhl3kd676hycw5l4a2hanxco7ab7n56elpexeanaa.domains.proton.ch" -> null
      - created_on      = "2025-02-01T20:40:57.738344Z" -> null
      - hostname        = "protonmail2._domainkey.lilja.io" -> null
      - id              = "ddb7f0e8bcc1a92e83459eb5643e2827" -> null
      - metadata        = {} -> null
      - modified_on     = "2025-02-01T20:40:57.738344Z" -> null
      - name            = "protonmail2._domainkey" -> null
      - proxiable       = true -> null
      - proxied         = false -> null
      - tags            = [] -> null
      - ttl             = 1 -> null
      - type            = "CNAME" -> null
      - zone_id         = "801ec7bc35b2abc9580d847c7b5c6f56" -> null
        # (1 unchanged attribute hidden)
    }

  # module.cloudflare_lilja_io_setup.cloudflare_record.cname_dkim1["protonmail3._domainkey"] will be destroyed
  # (because cloudflare_record.cname_dkim1 is not in configuration)
  - resource "cloudflare_record" "cname_dkim1" {
      - allow_overwrite = false -> null
      - content         = "protonmail3.domainkey.dqnuquyqjndrlhl3kd676hycw5l4a2hanxco7ab7n56elpexeanaa.domains.proton.ch" -> null
      - created_on      = "2025-02-01T20:40:59.251915Z" -> null
      - hostname        = "protonmail3._domainkey.lilja.io" -> null
      - id              = "e8665c888f0006a9b36f38ae80b860d1" -> null
      - metadata        = {} -> null
      - modified_on     = "2025-02-01T20:40:59.251915Z" -> null
      - name            = "protonmail3._domainkey" -> null
      - proxiable       = true -> null
      - proxied         = false -> null
      - tags            = [] -> null
      - ttl             = 1 -> null
      - type            = "CNAME" -> null
      - zone_id         = "801ec7bc35b2abc9580d847c7b5c6f56" -> null
        # (1 unchanged attribute hidden)
    }

  # module.cloudflare_lilja_io_setup.cloudflare_record.cname_records["protonmail._domainkey-protonmail.domainkey.dqnuquyqjndrlhl3kd676hycw5l4a2hanxco7ab7n56elpexeanaa.domains.proton.ch."] will be created
  + resource "cloudflare_record" "cname_records" {
      + allow_overwrite = false
      + content         = "protonmail.domainkey.dqnuquyqjndrlhl3kd676hycw5l4a2hanxco7ab7n56elpexeanaa.domains.proton.ch."
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "protonmail._domainkey"
      + proxiable       = (known after apply)
      + proxied         = false
      + ttl             = (known after apply)
      + type            = "CNAME"
      + value           = (known after apply)
      + zone_id         = "801ec7bc35b2abc9580d847c7b5c6f56"
    }

  # module.cloudflare_lilja_io_setup.cloudflare_record.cname_records["protonmail2._domainkey-protonmail2.domainkey.dqnuquyqjndrlhl3kd676hycw5l4a2hanxco7ab7n56elpexeanaa.domains.proton.ch."] will be created
  + resource "cloudflare_record" "cname_records" {
      + allow_overwrite = false
      + content         = "protonmail2.domainkey.dqnuquyqjndrlhl3kd676hycw5l4a2hanxco7ab7n56elpexeanaa.domains.proton.ch."
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "protonmail2._domainkey"
      + proxiable       = (known after apply)
      + proxied         = false
      + ttl             = (known after apply)
      + type            = "CNAME"
      + value           = (known after apply)
      + zone_id         = "801ec7bc35b2abc9580d847c7b5c6f56"
    }

  # module.cloudflare_lilja_io_setup.cloudflare_record.cname_records["protonmail3._domainkey-protonmail3.domainkey.dqnuquyqjndrlhl3kd676hycw5l4a2hanxco7ab7n56elpexeanaa.domains.proton.ch."] will be created
  + resource "cloudflare_record" "cname_records" {
      + allow_overwrite = false
      + content         = "protonmail3.domainkey.dqnuquyqjndrlhl3kd676hycw5l4a2hanxco7ab7n56elpexeanaa.domains.proton.ch."
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "protonmail3._domainkey"
      + proxiable       = (known after apply)
      + proxied         = false
      + ttl             = (known after apply)
      + type            = "CNAME"
      + value           = (known after apply)
      + zone_id         = "801ec7bc35b2abc9580d847c7b5c6f56"
    }

  # module.cloudflare_lilja_io_setup.cloudflare_record.mx_proton_mail["mail.protonmail.ch"] will be destroyed
  # (because cloudflare_record.mx_proton_mail is not in configuration)
  - resource "cloudflare_record" "mx_proton_mail" {
      - allow_overwrite = false -> null
      - comment         = "MX records for lilja.io zone." -> null
      - content         = "mail.protonmail.ch" -> null
      - created_on      = "2025-02-01T20:41:00.745141Z" -> null
      - hostname        = "lilja.io" -> null
      - id              = "17f1e94ab3576c93296900f09c2cad2f" -> null
      - metadata        = {} -> null
      - modified_on     = "2025-02-01T20:41:00.745141Z" -> null
      - name            = "lilja.io" -> null
      - priority        = 1 -> null
      - proxiable       = false -> null
      - proxied         = false -> null
      - tags            = [] -> null
      - ttl             = 1 -> null
      - type            = "MX" -> null
      - zone_id         = "801ec7bc35b2abc9580d847c7b5c6f56" -> null
    }

  # module.cloudflare_lilja_io_setup.cloudflare_record.mx_proton_mail["mailsec.protonmail.ch"] will be destroyed
  # (because cloudflare_record.mx_proton_mail is not in configuration)
  - resource "cloudflare_record" "mx_proton_mail" {
      - allow_overwrite = false -> null
      - comment         = "MX records for lilja.io zone." -> null
      - content         = "mailsec.protonmail.ch" -> null
      - created_on      = "2025-02-01T20:40:59.979317Z" -> null
      - hostname        = "lilja.io" -> null
      - id              = "2b9dab6700df6f8a389c327483b1a045" -> null
      - metadata        = {} -> null
      - modified_on     = "2025-02-01T20:40:59.979317Z" -> null
      - name            = "lilja.io" -> null
      - priority        = 2 -> null
      - proxiable       = false -> null
      - proxied         = false -> null
      - tags            = [] -> null
      - ttl             = 1 -> null
      - type            = "MX" -> null
      - zone_id         = "801ec7bc35b2abc9580d847c7b5c6f56" -> null
    }

  # module.cloudflare_lilja_io_setup.cloudflare_record.mx_proton_protomain_verification will be destroyed
  # (because cloudflare_record.mx_proton_protomain_verification is not in configuration)
  - resource "cloudflare_record" "mx_proton_protomain_verification" {
      - allow_overwrite = false -> null
      - content         = "protonmail-verification=9a69211edf7217e6d5f99e5507b53feb1b356f0d" -> null
      - created_on      = "2025-02-01T20:40:56.728774Z" -> null
      - hostname        = "lilja.io" -> null
      - id              = "91f6606f599ea13775f2eab5d362c384" -> null
      - metadata        = {} -> null
      - modified_on     = "2025-02-01T20:40:56.728774Z" -> null
      - name            = "lilja.io" -> null
      - proxiable       = false -> null
      - proxied         = false -> null
      - tags            = [] -> null
      - ttl             = 1 -> null
      - type            = "TXT" -> null
      - zone_id         = "801ec7bc35b2abc9580d847c7b5c6f56" -> null
        # (1 unchanged attribute hidden)
    }

  # module.cloudflare_lilja_io_setup.cloudflare_record.mx_proton_spf1 will be destroyed
  # (because cloudflare_record.mx_proton_spf1 is not in configuration)
  - resource "cloudflare_record" "mx_proton_spf1" {
      - allow_overwrite = false -> null
      - content         = "v=spf1 include:_spf.protonmail.ch mx ~all" -> null
      - created_on      = "2025-02-01T20:40:59.49959Z" -> null
      - hostname        = "lilja.io" -> null
      - id              = "27880e7ae87be1c5dcdde52d5763dfb4" -> null
      - metadata        = {} -> null
      - modified_on     = "2025-02-01T20:40:59.49959Z" -> null
      - name            = "lilja.io" -> null
      - proxiable       = false -> null
      - proxied         = false -> null
      - tags            = [] -> null
      - ttl             = 1 -> null
      - type            = "TXT" -> null
      - zone_id         = "801ec7bc35b2abc9580d847c7b5c6f56" -> null
        # (1 unchanged attribute hidden)
    }

  # module.cloudflare_lilja_io_setup.cloudflare_record.mx_records["mail.protonmail.ch"] will be created
  + resource "cloudflare_record" "mx_records" {
      + allow_overwrite = false
      + comment         = "MX records for lilja.io zone."
      + content         = "mail.protonmail.ch"
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "@"
      + priority        = 1
      + proxiable       = (known after apply)
      + proxied         = false
      + ttl             = 1
      + type            = "MX"
      + value           = (known after apply)
      + zone_id         = "801ec7bc35b2abc9580d847c7b5c6f56"
    }

  # module.cloudflare_lilja_io_setup.cloudflare_record.mx_records["mailsec.protonmail.ch"] will be created
  + resource "cloudflare_record" "mx_records" {
      + allow_overwrite = false
      + comment         = "MX records for lilja.io zone."
      + content         = "mailsec.protonmail.ch"
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "@"
      + priority        = 2
      + proxiable       = (known after apply)
      + proxied         = false
      + ttl             = 1
      + type            = "MX"
      + value           = (known after apply)
      + zone_id         = "801ec7bc35b2abc9580d847c7b5c6f56"
    }

  # module.cloudflare_lilja_io_setup.cloudflare_record.txt_dmarc will be destroyed
  # (because cloudflare_record.txt_dmarc is not in configuration)
  - resource "cloudflare_record" "txt_dmarc" {
      - allow_overwrite = false -> null
      - content         = "v=DMARC1; p=quarantine" -> null
      - created_on      = "2025-02-01T20:40:57.48028Z" -> null
      - hostname        = "_dmarc.lilja.io" -> null
      - id              = "34dcc8e8ec712be680b004d4071f5a89" -> null
      - metadata        = {} -> null
      - modified_on     = "2025-02-01T20:40:57.48028Z" -> null
      - name            = "_dmarc" -> null
      - proxiable       = false -> null
      - proxied         = false -> null
      - tags            = [] -> null
      - ttl             = 1 -> null
      - type            = "TXT" -> null
      - zone_id         = "801ec7bc35b2abc9580d847c7b5c6f56" -> null
        # (1 unchanged attribute hidden)
    }

  # module.cloudflare_lilja_io_setup.cloudflare_record.txt_records["_dmarc-v=DMARC1; p=quarantine"] will be created
  + resource "cloudflare_record" "txt_records" {
      + allow_overwrite = false
      + content         = "v=DMARC1; p=quarantine"
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "_dmarc"
      + proxiable       = (known after apply)
      + proxied         = false
      + ttl             = (known after apply)
      + type            = "TXT"
      + value           = (known after apply)
      + zone_id         = "801ec7bc35b2abc9580d847c7b5c6f56"
    }

  # module.cloudflare_lilja_io_setup.cloudflare_record.txt_records["lilja.io-protonmail-verification=9a69211edf7217e6d5f99e5507b53feb1b356f0d"] will be created
  + resource "cloudflare_record" "txt_records" {
      + allow_overwrite = false
      + content         = "protonmail-verification=9a69211edf7217e6d5f99e5507b53feb1b356f0d"
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "lilja.io"
      + proxiable       = (known after apply)
      + proxied         = false
      + ttl             = (known after apply)
      + type            = "TXT"
      + value           = (known after apply)
      + zone_id         = "801ec7bc35b2abc9580d847c7b5c6f56"
    }

  # module.cloudflare_lilja_io_setup.cloudflare_record.txt_records["lilja.io-v=spf1 include:_spf.protonmail.ch mx ~all"] will be created
  + resource "cloudflare_record" "txt_records" {
      + allow_overwrite = false
      + content         = "v=spf1 include:_spf.protonmail.ch mx ~all"
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "lilja.io"
      + proxiable       = (known after apply)
      + proxied         = false
      + ttl             = (known after apply)
      + type            = "TXT"
      + value           = (known after apply)
      + zone_id         = "801ec7bc35b2abc9580d847c7b5c6f56"
    }

Plan: 8 to add, 0 to change, 8 to destroy.
```

*Pusher: @jlilja, Action: `pull_request`, Workflow: `Plan Terraform code on PR`*